package week7.김누리.programmers;

/**
 * PackageName : week7.김누리.programmers
 * FileName    : 예상_대진표
 * Author      : 김누리(NRKim)
 * Date        : 2025-06-11
 * Description :
 * =====================================================================================================================
 * DATE          AUTHOR               NOTE
 * ---------------------------------------------------------------------------------------------------------------------
 * 2025. 06. 11.     김누리(NRKim)               Initial creation
 */

/*
*
* 각 노드별로 계산 필요.
*
* 예)
*
* N = 8, A = 4, B = 7인 경우
*
*
*   ┌──4───┐        ┌──7───┐
* ┌─2─┐  ┌─4─┐   ┌─5─┐   ┌─7─┐
* 1   2  3   4   5   6   7   8
*
*이 상황을 구현해야함.
*
* a = 4/2 + 4%2 ==> 2 + 0 ==> 2 // b = 8/2 + 8%2 ==> 4 + 0 == >4 // a != b answer++
* a = 2/2 + 2%2 ==> 1 + 0 ==> 1 // b = 4/2 + 4%2 ==> 2 + 0 ==> 2 // a != b answer++
* a = 1/2 + 1%2 ==> 0 + 1 ==> 1 // b = 2/2 + 2%2 ==> 1 + 0 ==> 1 // a == b return
*
* a = a/2 + a%2 사유 :
* 다음 라운드에서의 번호 계산을 위함.
* a = 홀수인 경우 a%2 처리 짝수번호는 a/2 처리의 결과 값이랑 같기 때문에 진행해야 함
*
*
* */

public class 예상_대진표 {
	public int solution(int n, int a, int b)
	{
		int answer = 1;

		while(true) {
			a = a/2 + a%2;
			b = b/2 + b%2;

			if(a==b) {
				return answer;
			} else {
				answer++;
			}
		}

	}
}
