package week17.김누리.programmers;

/**
 * PackageName : week17.김누리.programmers
 * FileName    : 기사단원의_무기
 * Author      : 김누리(NRKim)
 * Date        : 2025-08-17
 * Description :
 * =====================================================================================================================
 * DATE          AUTHOR               NOTE
 * ---------------------------------------------------------------------------------------------------------------------
 * 2025. 08. 17.     김누리(NRKim)               Initial creation
 */

/*
Case 1
    1 4    3 3
    3 2    3 3
    4 1

    1*3 + 4*3  1*3 + 4*3 => 15 15
    3*3 + 2*3  3*3 + 2*3 => 15 15
    4*3 + 1*3  4*3 + 1*3 => 15 15

    ※ [[15,15],[15,15],[15,15]]

Case 2
    2 3 2    5 4 3
    4 2 4    2 4 1
    3 1 4    3 1 1

    2*5 + 3*2 + 2*3  2*4 + 3*4 + 2*1  2*3 + 3*1 + 2*1 => 22 22 11
    4*5 + 2*2 + 4*3  4*4 + 2*4 + 4*1  4*3 + 2*1 + 4*1 => 36 28 18
    3*5 + 1*2 + 4*3  3*4 + 1*4 + 4*1  3*3 + 1*1 + 4*1 => 29 20 14

    ※ [[22,22,11],[36,28,18],[29,20,14]]

결론
    입력값 :
        arr1 = [arr1[0][0],arr1[0][1]],[arr1[1][0],arr1[1][1]],[arr1[2][0],arr1[2][1]]]
        arr2 = [arr2[0][0],arr2[0][1]],[arr2[1][0],arr2[1][1]]

        return [
                    [arr1[0][0]*arr2[0][0] + arr1[0][1]*arr2[1][0] , arr1[0][0]*arr2[1][0] + arr1[0][1]*arr2[1][1]] ,
                    [arr1[1][0]*arr2[0][0] + arr1[1][1]*arr2[1][0] , arr1[1][0]*arr2[1][0] + arr1[1][1]*arr2[1][1]] ,
                    [arr1[2][0]*arr2[0][0] + arr1[2][1]*arr2[1][0] , arr1[2][0]*arr2[1][0] + arr1[2][1]*arr2[1][1]]
                ]

*/

public class 행렬의_곱셈 {
	public int[][] solution(int[][] arr1, int[][] arr2) {
		int[][] answer = new int[arr1.length][arr2[0].length];

		for(int i = 0 ; i < arr1.length; i++) {
			for (int j = 0; j < arr2[0].length; j++) {
				for(int k = 0; k < arr1[0].length; k++) {
					answer[i][j] += arr1[i][k] * arr2[k][j];
				}
			}
		}

		return answer;
	}
}
