/**
 * PackageName : week7.이상억.progarmmers;
 * FileName    : 예상_대진표
 * Author      : sangeok
 * Date        : 2025. 6. 9.
 * Description :
 * =====================================================================================================================
 * DATE          AUTHOR               NOTE
 * ---------------------------------------------------------------------------------------------------------------------
 * 2025. 6. 9.     sangeok               Initial creation
 */

//문제 요구사항 :	n 명이 참가 (1,2) (3,4) ..... (n-1, n) 까지
//			다시 (1,2) (3,4) .... (n-1/2, n/2) 까지
//			a번 과 b 번이 만나려면 몇번해야하나 ?
//
//접근 방식 : (1) 1-2 3-4 5-6 7-8
//			1-2 3-4
//			   1-2

class Solution {
    public int solution(int n, int a, int b) {
        int answer = 0;

        while (a != b) {
            a = (a + 1) / 2;
            b = (b + 1) / 2;
            answer++;
        }

        return answer;
    }
}
