package Week1.김누리.programmers;

/**
 * PackageName : Week1.김누리.programmers
 * FileName    : 푸드_파이트_대회
 * Author      : 김누리
 * Date        : 2025-04-25
 * Description :
 * =====================================================================================================================
 * DATE          AUTHOR               NOTE
 * ---------------------------------------------------------------------------------------------------------------------
 * 2025. 04. 25.     김누리               Initial creation
 */
public class 푸드_파이트_대회 {
}
